# Terraform environment test
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1jMjE3YTNlYS00MDJmLTQ4ODYtYWNlNS00NzhkYjcyYWI0Yzk7b2JqZWN0SWQ9Y2M3NWExY2MtZDZhMS00NTMwLTgyOGYtODY4MzJjZTkxYjliO3N1YnNjcmlwdGlvbklkPTM3YmFjNjNhLWI5NjQtNDZiMi04ZGU4LWJhOTNjNDMyZWExZjt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.aks.azurerm_kubernetes_cluster.aks will be updated in-place
  ~ resource "azurerm_kubernetes_cluster" "aks" {
        id                                  = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/auth-at22-aks-rg/providers/Microsoft.ContainerService/managedClusters/auth-at22-aks"
      ~ kubernetes_version                  = "1.30" -> "1.31"
        name                                = "auth-at22-aks"
        tags                                = {}
        # (34 unchanged attributes hidden)

      ~ default_node_pool {
            name                          = "syspool"
          ~ orchestrator_version          = "1.30" -> "1.31"
            tags                          = {}
            # (29 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (10 unchanged blocks hidden)
    }

  # module.aks.azurerm_kubernetes_cluster_node_pool.workpool will be updated in-place
  ~ resource "azurerm_kubernetes_cluster_node_pool" "workpool" {
        id                            = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/auth-at22-aks-rg/providers/Microsoft.ContainerService/managedClusters/auth-at22-aks/agentPools/workpool"
        name                          = "workpool"
      ~ orchestrator_version          = "1.30" -> "1.31"
        tags                          = {}
        # (30 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.observability.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.observability.azurerm_key_vault.obs_kv will be updated in-place
  ~ resource "azurerm_key_vault" "obs_kv" {
        id                              = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/auth-at22-obs-rg/providers/Microsoft.KeyVault/vaults/obs-auth-at22-KfSfKV"
        name                            = "obs-auth-at22-KfSfKV"
        tags                            = {}
      ~ tenant_id                       = (sensitive value)
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.observability.azurerm_role_assignment.ci_kv_secrets_role must be replaced
-/+ resource "azurerm_role_assignment" "ci_kv_secrets_role" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/auth-at22-obs-rg/providers/Microsoft.KeyVault/vaults/obs-auth-at22-KfSfKV/providers/Microsoft.Authorization/roleAssignments/2da3b8d7-a837-8e78-781a-7133287029ae" -> (known after apply)
      ~ name                                   = "2da3b8d7-a837-8e78-781a-7133287029ae" -> (known after apply)
      ~ principal_id                           = "cc75a1cc-d6a1-4530-828f-86832ce91b9b" -> (known after apply) # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/providers/Microsoft.Authorization/roleDefinitions/b86a8fe4-44ce-4948-aee5-eccb2c155cd7" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 1 to add, 3 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @renovate[bot] |
| Action | `pull_request` |
| Working Directory | `./infrastructure/altinn-auth-test/auth-at22-aks-rg` |
| State File | `github.com/altinn/altinn-platform/environments/test/auth-at22-aks-rg.tfstate` |
| Plan File | `github.com_altinn_altinn-platform_environments_test_auth-at22-aks-rg.tfstate.tfplan`